Revit 2027 API
Element.GetMonitoredLinkElementIds Method
 Provides the link instance IDs when the element is monitoring.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetMonitoredLinkElementIds()
Public Function GetMonitoredLinkElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetMonitoredLinkElementIds()
member GetMonitoredLinkElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The IDs of linked instances.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace